Repository: 84000/data-translation-memory
Catalog: toh205-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་གྲོང་ཁྱེར་གྱིས་འཚོ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra The City Beggar Woman

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། རྒྱལ་པོ་དང་། བློན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་རྣམས་ཀྱིས་བཀུར་སྟིར་བྱས།
en: While staying in Śrāvastī, in Prince Jeta’s Grove, Anāthapiṇḍada’s park, the Blessed One was served, honored, venerated, and revered by gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas; by Śakra, Brahmā, and the world protectors; by kings and ministers; and by bodhisattvas, monks, nuns, laymen, and laywomen.

source: བླ་མར་བྱས། མཆོད་ཅིང་བརྗེད་དེ། པད་མ་ཆུས་མ་གོས་པ་བཞིན་དུ་བཞུགས་སོ། །
en: Yet he remained like a lotus unsullied by water.

source: དེ་ནས་དེའི་ཚེ་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ཕྱིར་སྟོན་ཟླ་ཐ་ཆུང་ས་ཟླ་བ་ཉ་བའི་ཚེས་བཅྭ་ལྔ་ལ། འབྲུ་མར་གྱིས་ཟངས་པོ་ཆེ་སྟོང་བཀང་སྟེ་དངར་ནས་མར་མེ་སྦར་བའི་འོད་ཀྱིས་ཁོ་ར་ཁོར་ཡུག་ཏུ་དཔག་ཚད་བཞིར་སྣང་བས་ཁྱབ་པར་བྱས་སོ། །
en: At that time, in order to venerate the Thus-Gone One, on the full moon day of the last month of autumn, King Prasenajit had a thousand large copper cauldrons filled with grain oil and set them out so that the entire area for four leagues around was illuminated by their flames.

source: དེ་ནས་ཡང་དེའི་ཚེ་མཉན་ཡོད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ན་དགའ་བྱེད་མ་ཞེས་བྱ་བ་གྲོང་ཁྱེར་གྱིས་འཚོ་བ་ཞིག་འདུག་གོ། །
en: At the same time, in the great city of Śrāvastī, there was a city beggar woman called Maker of Joy.

source: དེས་འབྲུ་མར་སྲན་གྲེའུ་དང་སྦྱར་བ་ཉོས་ནས་ཞག་བཞི་ཁ་འཚོས་ཏེ་ཉམ་ཆུང་བར་གྱུར་ཏོ། །
en: She had bought a tiny amount of oil, as a result of which she had gone without food for four days and had grown weak.

source: དེ་ནས་འབྲུ་མར་དེ་ཁྱེར་ཏེ་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་སོང་ནས་ཁྱམས་ཀྱི་ནང་ལོགས་སུ་མར་མེ་སྦར་ཏེ་བཞག་ནས་འདི་ལྟར་སེམས་བསྐྱེད་དེ། །
en: She took the oil to Prince Jeta’s Grove and, using it to light a lamp at the edge of the courtyard, she made this wish: “Blessed One, with this root of virtue, may I too become a teacher in the future.

source: བཅོམ་ལྡན་འདས་བདག་དགེ་བའི་རྩ་བ་འདིས་མ་འོངས་པའི་དུས་ན་ཇི་ལྟར་ད་ལྟར་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཇི་ལྟ་བ་བཞིན་དུ་བདག་ཀྱང་མ་འོངས་པའི་དུས་ན་སྟོན་པར་གྱུར་ཏེ་ཆོས་སྟོན་པར་གྱུར་ཅིག །དགེ་འདུན་ཡང་སྡུད་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །འདི་ལྟར་ཡང་སེམས་བསྐྱེད་དེ།
en: May I teach the Dharma and gather a community, just as the thus-gone, worthy, perfect, and complete Buddha does now.

source: གལ་ཏེ་བདག་མ་འོངས་པའི་དུས་ན་སངས་རྒྱས་སུ་འགྱུར་བ་ཞིག་ན། མར་མེ་འདི་བདག་ཕྱིར་མ་འོངས་ཀྱི་བར་དུ་འབར་བར་གྱུར་ཅིག་ཅེས་བྱས་ནས་མར་མེ་དེ་སྤར་ཏེ་གྲོང་ཁྱེར་དུ་སོང་ན།
en: If I am to become a buddha in the future, may this oil lamp continue to burn until I return.” Whereupon she lit the lamp, and returned to the city.

source: མར་མེ་དེའི་འོད་ཀྱིས་འཛམ་བུའི་གླིང་ཐམས་ཅད་སྣང་བར་གྱུར་ཏེ་ནམ་ནངས་ཀྱི་བར་དུ་ཡང་མར་མེ་དེ་མ་ཤིའོ། །
en: The light of that oil lamp illuminated all of Jambudvīpa and the following day the lamp was still burning.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽང་གལ་གྱི་བུ་ཆེན་པོས་ཆོས་གོས་ཀྱི་མཐའ་མས་མར་མེ་གསད་པར་བྱས་ན་གསད་པར་མ་ནུས་སོ། །
en: Then Venerable Mahā­maudgalyāyana tried to put it out with the edge of his robe, but he could not.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་རྣམ་པར་འཐོར་རླུང་གིས་གསད་པར་བྱས་ཀྱང་གསད་པར་མ་ནུས་སོ། །
en: Venerable Mahā­maudgalyāyana then tried to extinguish it with gales of wind, but still he could not put it out.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽང་གལ་གྱི་བུ་ཆེན་པོས་ཚངས་པའི་འཇིག་རྟེན་དུ་འདུག་ནས་སྟོང་གསུམ་འདིར་ཤིང་རྟའི་སྲོག་ཤིང་ཙམ་གྱི་ཆར་གྱི་རྒྱུན་དབབ་པར་བྱིན་གྱིས་བརླབས་ཏེ་མར་མེ་དེའི་སྟེང་དུ་བཏང་ཡང་གསད་པར་མ་ནུས་སོ། །
en: Venerable Mahā­maudgalyāyana then went to the Brahmā realms and caused sheets of rain the size of chariot axles to fall upon this whole trichiliocosm. However, even though he directed the deluge right over the lamp, still he could not douse it.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་ཐོང་ཤིག །
en: Then the Blessed One said, “Let it be, Maudgalyāyana!

source: མར་མེ་འདི་ནི་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱིས་སྦར་བ་ཡིན་ལ། བྱང་ཆུབ་ཀྱི་སེམས་ནི་ཉན་ཐོས་ཀྱིས་ཟིལ་གྱིས་གནན་པར་མི་ནུས་སོ། །
en: This lamp has been lit with a mind set on awakening, and a mind set on awakening cannot be overcome by a śrāvaka.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: How so?

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཟིལ་གྱིས་གནན་དུ་མེད་པའི་ཕྱིར་རོ། །
en: Because no śrāvaka or pratyekabuddha can ever overcome a mind set on omniscience.”

source: དེ་ནས་རེ་ཞིག་ན་བུད་མེད་དེ་ཉི་མ་ཤར་ཏེ་གྲོང་ཁྱེར་ནས་ཕྱིར་འོངས་ནས།
en: A while later, as the sun was rising, the woman returned from the city.

source: དེས་མར་མེ་དེ་ཤིན་ཏུ་འབར་བ་མཐོང་བ་དང་། དེ་མཆོག་ཏུ་དགའ་བ་ཆེན་པོས་རྒྱས་པར་གྱུར་ཏོ། །
en: When she saw that the lamp was still burning brightly, she was filled with tremendous joy.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་འཛུམ་པ་མཛད་དོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཉིད་ནི་འདི་ཡིན་ཏེ།
en: At that moment, the Blessed One smiled.

source: གང་གི་ཚེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་པ་དེའི་ཚེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་ཁ་དོག་དུ་མ་འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། བཙོད་ཀ་དང་།
en: It is the nature of things that whenever a blessed buddha smiles, rays of light of many colors—blue, yellow, red, white, crimson, and the colors of crystal and silver—stream forth from the blessed buddha’s mouth.

source: ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་དག་བྱུང་བར་གྱུར་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་དག་སྣང་བས་ཁྱབ་པར་བྱས་ནས་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་སོང་སྟེ་ཟླ་བ་དང་ཉི་མའི་འོད་ཀྱང་ཟིལ་གྱིས་མནན་ནས་ཡང་སླར་ལོག་སྟེ་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏོར་དུ་ནུབ་པར་གྱུར་ཏོ། །
en: These illuminate and pervade worlds without end, reaching as far as the Brahmā realms where they outshine even the sun and the moon. They then return once again, and, after circling the blessed one thrice, descend into the uṣṇīṣa at the crown of that blessed one’s head.

source: དེ་ནས་འོད་ཟེར་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏོར་དུ་མི་སྣང་བར་གྱུར་ཏོ། །
en: So, indeed, did such rays of light, having circled the Blessed One thrice, disappear into the uṣṇīṣa of the Blessed One’s head.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་ཚིགས་སུ་བཅད་དེ་གསོལ་པ། རྒྱལ་མཆོག་རྣམ་པར་འདྲེན་པ་གང་ཟག་མཆོག །རྒྱུ་མེད་པར་ནི་འཛུམ་པ་མི་མཛད་ན། །ཅི་ཡི་རྐྱེན་གྱིས་ཞལ་ནི་འཛུམ་མཛད་པ། །འཇིག་རྟེན་ཕན་པ་ཐུགས་བརྩེས་བདག་ལ་གསུངས། །
en: Venerable Ānanda then spoke the following verse to the Blessed One: “Excellent victor, guide, and best of men, You do not smile without reason, So please, with compassion, for the benefit of the world, Tell us what gives you cause to smile.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་གྲོང་ཁྱེར་གྱིས་འཚོ་བ་འདི་བསྐལ་པ་ཉི་ཤུ་རྩ་བརྒྱད་ཀྱི་བར་དུ་ངན་འགྲོ་ལོག་པར་ལྟུང་བར་འགྲོ་བར་མི་འགྱུར་ཏེ།
en: The Blessed One replied, “Ānanda, this city beggar woman will not fall into a lower rebirth for twenty-eight eons.

source: རྟག་ཏུ་ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་དག་ཉམས་སུ་མྱོང་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་དུ་སྣང་བ་ཞེས་བྱ་བར་འགྱུར་རོ། །
en: She will experience only the abundance of the human and god realms, and then will become a thus-gone, worthy, perfect, and complete buddha called All-Illuminating.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །སྟོབས་བཅུ་ལྡན་པ་མཆོད་ཕྱིར་ཟངས་ཆེན་ཕྲག་སྟོང་གསལ་རྒྱལ་གྱིས། །མར་མེ་བཟང་པོ་སྦར་བས་དཔག་ཚད་བཞིར་ནི་ཀུན་དུ་སྣང་། །
en: Then the Blessed One spoke these verses: “To venerate the holder of ten powers, Prasenajit lit a thousand fine lamps In huge copper cauldrons, which illuminated everything for four leagues.

source: གྲོང་ཁྱེར་འཚོ་བའི་འབྲུ་མར་སྲན་མ་གྲེའུ་སྦྱར་སྦར་བ་ཡིས། །འཛམ་གླིང་སྣང་བས་ཁྱབ་གྱུར་དེ་ནི་བྱང་ཆུབ་སེམས་ཀྱི་མཐུས། །
en: The city beggar woman lit a lamp with a tiny amount of oil And, by the power of the mind set on awakening, it illuminated the whole world.

source: མཽད་གལ་གྱིས་ནི་མར་མེ་གསད་འདོད་རྫུ་འཕྲུལ་རྒྱ་ཆེན་བྱས། །རྣམ་པར་འཐོར་བའི་རླུང་གི་ཤུགས་བཏང་གསད་པར་ཡོང་མ་ནུས། །
en: “Maudgalyāyana wanted to extinguish the lamp with his vast magical powers, But even powerful gales could not extinguish it.

source: ཚངས་པའི་འཇིག་རྟེན་འདུག་ནས་ཆུ་རྒྱུན་ཤིང་རྟའི་སྲོག་ཤིང་ཙམ། །ཕབ་ཀྱང་གསད་པར་མ་ནུས་མར་མེ་ཉི་མའི་འོད་བཞིན་སྣང་། །
en: Sending down sheets of rain the size of chariot axles from the Brahmā realms, Still he could not douse that lamp, which shone like the sun.

source: དེ་ནི་ཞག་བཞི་ཁ་འཚོས་རྒྱལ་བྱེད་དགའ་བའི་ཚལ་དུ་འོངས། །དགའ་བའི་སེམས་ཀྱིས་བདེ་གཤེགས་ཞབས་ལ་ཕྱག་བྱས་ཐལ་སྦྱར་འདུག །
en: “After four days with no food, she came to the delightful Jeta Grove And, with joyful heart, paid respects with folded hands to the feet of the Sugata.

source: མཉམ་མེད་འཛུམ་པ་མཛད་པས་ཀུན་དགའ་བོ་ཡང་རབ་དགའ་ནས། །གཟི་བརྗིད་མཐའ་ཡས་འཛུམ་མཛད་འདི་ཡི་འབྲས་བུ་ཇི་འདྲ་གསུངས། །
en: The peerless one smiled, and Ānanda, thoroughly delighted, asked, ‘What kind of result does this smile foretell, infinitely radiant one?’

source: དགའ་བྱེད་འདི་ནི་བསྐལ་པ་ཉི་ཤུ་བརྒྱད་ན་རྒྱལ་བར་འགྱུར། །རང་བྱུང་ཀུན་སྣང་ཞེས་བྱ་འོད་ཀྱིས་སྟོང་ཆེན་བཞི་སྣང་བྱེད། །
en: “In twenty-eight eons, this Maker of Joy will be a victor, a self-arisen one Known as All-Illuminating, and she will illuminate four great chiliocosms.

source: མ་འོངས་དུས་ན་བདེ་བར་གཤེགས་པ་བྱེ་བ་མཆོད་པར་འགྱུར། །དེ་ནི་ཀུན་དུ་འཁོར་ལོས་སྒྱུར་འགྱུར་རྒྱལ་རྣམས་བཀུར་སྟིར་བྱེད། །
en: In the future, she will make offerings to ten million sugatas; She will become a universal monarch and venerate the victors.

source: སངས་རྒྱས་རྟོགས་པ་བརྗོད་པ་ཡི་ནི་དད་རྣམས་རབ་དགའ་བྱེད། །སྐྱེ་བོ་མཁས་པ་དག་གིས་དེ་ཐོས་སེམས་ཀྱང་རབ་ཏུ་དགའ། །
en: “This exemplary tale about a future buddha will delight the faithful And the wise who hear it will also feel joy.

source: དེ་ལྟར་རྒྱལ་བ་བསམ་ཡས་སྟོབས་བཅུའི་ཆོས་ཀྱང་བསམ་མི་ཁྱབ། །
en: In this way, the qualities of innumerable victors with the ten powers are inconceivable.

source: དགའ་བ་བསྐྱེད་ན་རྣམ་སྨིན་མཚུངས་མེད་བསམ་གྱིས་མི་ཁྱབ་འགྱུར། །
en: So the matchless result of rejoicing in them will also be inconceivable.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། གྲོང་ཁྱེར་གྱིས་འཚོ་བ་དེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། དགེ་སློང་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: Thus spoke the Blessed One, and Venerable Ānanda, the city beggar woman, the bodhisattvas and monks, along with the gods, humans, asuras, and gandharvas of the world, rejoiced and thoroughly praised what the Blessed One had said.

source: འཕགས་པ་གྲོང་ཁྱེར་གྱིས་འཚོ་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This concludes The Noble Mahāyāna Sūtra “The City Beggar Woman.”

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛྙཱ་ན་གརྦྷ་དང་། ལོ་ཙྪ་བ་བན་དེ་ཀླུའི་དབང་པོས་བསྒྱུར་བ། རྒྱ་གར་གྱི་མཁན་པོ་བིདྱཱ་ཀ་ར་སིང་ཧ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་དེ་བ་ཙན་དྲས་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།​། །​།
en: Translated by the Indian preceptor Jñānagarbha and Lotsawa Bandé Lui Wangpo. Edited and finalized by the Indian preceptor Vidyākarasiṃha and senior editor Lotsawa Bandé Devacandra.
